In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
## print version of np

print(np.__version__)

1.23.0

## Data

In [6]:
url = 'https://raw.githubusercontent.com/alexeygrigorev/mlbookcamp-code/master/chapter-02-car-price/data.csv'

df = pd.read_csv(url)
df.head()

,Make,Model,Year,Engine Fuel Type,Engine HP,Engine Cylinders,Transmission Type,Driven_Wheels,Number of Doors,Market Category,Vehicle Size,Vehicle Style,highway MPG,city mpg,Popularity,MSRP
0,BMW,1 Series M,2011,premium unleaded (required),335.0,6.0,MANUAL,rear wheel drive,2.0,"Factory Tuner,Luxury,High-Performance",Compact,Coupe,26,19,3916,46135
1,BMW,1 Series,2011,premium unleaded (required),300.0,6.0,MANUAL,rear wheel drive,2.0,"Luxury,Performance",Compact,Convertible,28,19,3916,40650
2,BMW,1 Series,2011,premium unleaded (required),300.0,6.0,MANUAL,rear wheel drive,2.0,"Luxury,High-Performance",Compact,Coupe,28,20,3916,36350
3,BMW,1 Series,2011,premium unleaded (required),230.0,6.0,MANUAL,rear wheel drive,2.0,"Luxury,Performance",Compact,Coupe,28,18,3916,29450
4,BMW,1 Series,2011,premium unleaded (required),230.0,6.0,MANUAL,rear wheel drive,2.0,Luxury,Compact,Convertible,28,18,3916,34500

## Question 2
How many records are in the dataset?

In [7]:
df.shape

(11914, 16)

## Question 3
Who are the most frequent car manufacturers (top-3) according to the dataset?

In [9]:
df['Make'].value_counts()[:4]

Chevrolet     1123
Ford           881
Volkswagen     809
Toyota         746
Name: Make, dtype: int64

## Question 4
Number of unique Audi car models

In [18]:
df.query('Make=="Audi"').shape

(328, 16)

In [21]:
df.query('Make=="Audi"')['Model'].value_counts().shape

(34,)

## Question 5
How many columns in the dataset have missing values?

In [29]:
df.isna().sum()

Make                    0
Model                   0
Year                    0
Engine Fuel Type        3
Engine HP              69
Engine Cylinders       30
Transmission Type       0
Driven_Wheels           0
Number of Doors         6
Market Category      3742
Vehicle Size            0
Vehicle Style           0
highway MPG             0
city mpg                0
Popularity              0
MSRP                    0
dtype: int64

## Question 6
Find the median value of "Engine Cylinders" column in the dataset.

In [32]:
df['Engine Cylinders'].median()

6.0

Next, calculate the most frequent value of the same "Engine Cylinders".

In [38]:
df['Engine Cylinders'].value_counts()

4.0     4752
6.0     4489
8.0     2031
12.0     230
5.0      225
10.0      68
0.0       56
3.0       30
16.0       3
Name: Engine Cylinders, dtype: int64

Use the fillna method to fill the missing values in "Engine Cylinders" with the most frequent value from the previous step.

In [39]:
df['Engine Cylinders'].isna().sum()

30

In [40]:
df['Engine Cylinders'].fillna(4.0).isna().sum()

0

Now, calculate the median value of "Engine Cylinders" once again.
Has it changed?

In [41]:
df['Engine Cylinders'].fillna(4.0).median()

6.0

## Question 7
Select all the "Lotus" cars from the dataset.

In [45]:
df.query('Make=="Lotus"')[:3]

,Make,Model,Year,Engine Fuel Type,Engine HP,Engine Cylinders,Transmission Type,Driven_Wheels,Number of Doors,Market Category,Vehicle Size,Vehicle Style,highway MPG,city mpg,Popularity,MSRP
3912,Lotus,Elise,2009,premium unleaded (required),189.0,4.0,MANUAL,rear wheel drive,2.0,"Exotic,High-Performance",Compact,Convertible,27,21,613,43995
3913,Lotus,Elise,2009,premium unleaded (required),218.0,4.0,MANUAL,rear wheel drive,2.0,"Exotic,High-Performance",Compact,Convertible,26,20,613,54990
3914,Lotus,Elise,2009,premium unleaded (required),189.0,4.0,MANUAL,rear wheel drive,2.0,"Exotic,High-Performance",Compact,Convertible,27,21,613,47250

Select only columns "Engine HP", "Engine Cylinders".

In [51]:
df.query('Make=="Lotus"').loc[:,["Engine HP","Engine Cylinders"]][:5]

      Engine HP  Engine Cylinders
3912      189.0               4.0
3913      218.0               4.0
3914      189.0               4.0
3915      189.0               4.0
3916      218.0               4.0

Now drop all duplicated rows using drop_duplicates method (you should get a dataframe with 9 rows).

In [50]:
df.query('Make=="Lotus"').loc[:,["Engine HP","Engine Cylinders"]].drop_duplicates()

      Engine HP  Engine Cylinders
3912      189.0               4.0
3913      218.0               4.0
3918      217.0               4.0
4216      350.0               8.0
4257      400.0               6.0
4259      276.0               6.0
4262      345.0               6.0
4292      257.0               4.0
4293      240.0               4.0

Get the underlying NumPy array. Let's call it X.

Compute matrix-matrix multiplication between the transpose of X and X.

To get the transpose, use X.T. Let's call the result XTX.

In [52]:
X = df.query('Make=="Lotus"').loc[:,["Engine HP","Engine Cylinders"]].drop_duplicates()

X.shape

(9, 2)

In [53]:
X.T.shape

(2, 9)

In [55]:
XTX = X.T@X

XTX.shape

(2, 2)

Compute the inverse of XTX.

In [57]:
np.linalg.inv(XTX)

array([[ 5.53084235e-05, -2.94319825e-03],
       [-2.94319825e-03,  1.60588447e-01]])

In [66]:
(np.linalg.inv(XTX) @ XTX).apply(np.round)

   Engine HP  Engine Cylinders
0        1.0              -0.0
1        0.0               1.0

In [68]:
(np.linalg.inv(XTX) @ XTX) @ X.T

    3912   3913   3918   4216   4257   4259   4262   4292   4293
0  189.0  218.0  217.0  350.0  400.0  276.0  345.0  257.0  240.0
1    4.0    4.0    4.0    8.0    6.0    6.0    6.0    4.0    4.0

In [69]:
X.T

,3912,3913,3918,4216,4257,4259,4262,4292,4293
Engine HP,189.0,218.0,217.0,350.0,400.0,276.0,345.0,257.0,240.0
Engine Cylinders,4.0,4.0,4.0,8.0,6.0,6.0,6.0,4.0,4.0

Create an array y with values [1100, 800, 750, 850, 1300, 1000, 1000, 1300, 800].

In [79]:
y = np.array([1100, 800, 750, 850, 1300, 1000, 1000, 1300, 800])

Multiply the inverse of XTX with the transpose of X, and then multiply the result by y. Call the result w.

In [83]:
(np.linalg.inv(XTX) @ X.T)

,3912,3913,3918,4216,4257,4259,4262,4292,4293
0,-0.001320,0.000284,0.000229,-0.004188,0.004464,-0.002394,0.001422,0.002441,0.001501
1,0.086089,0.000737,0.003680,0.254588,-0.213749,0.151208,-0.051873,-0.114048,-0.064014

In [86]:
(np.linalg.inv(XTX) @ X.T) @ y

0     4.594945
1   -63.564325
dtype: float64

What's the value of the first element of w

In [87]:
w = (np.linalg.inv(XTX) @ X.T) @ y

In [88]:
w[0]

4.594944810094551